app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "price", "stock_quantity", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save