app/views/products/index.html.erb


<p> Average: <%= Product.all.average('price') %> </p>
<p> Maximum: <%= Product.all.maximum('price') %> </p>
<p> Total Unique Products: <%= Product.all.count %> </p>
<p> Total Inventory: <%= Product.all.sum('stock_quantity') %> </p>
---
SELECT "products".* FROM "products"
SELECT MAX("products"."price") AS max_id FROM "products"
SELECT COUNT(*) FROM "products"
SELECT SUM("products"."stock_quantity") AS sum_id FROM "products"